---
kind: property
id: P:Autodesk.Revit.UI.TextBox.Image
source: html/bd8ce755-515f-4fcf-1009-b83fc14c0e12.htm
---
# Autodesk.Revit.UI.TextBox.Image Property

The image of the TextBox.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.